TEMP/Documents/COV_ПрохождениеВакцинацииГрупповой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>COV_ПрохождениеВакцинацииГрупповой</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.COV_ПрохождениеВакцинацииОтCOVID</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидВакцинации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.COV_ВидыВакцинации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВакцинации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВакцины</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.COV_ТипыВакцины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпонентВакцины</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПрививки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

TEMP/InformationRegisters/COV_ПрохождениеВакцинацииОтCOVID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>COV_ПрохождениеВакцинацииОтCOVID</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компонент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПрививки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВакцины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.COV_ВидыВакцинации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВакцины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.COV_ТипыВакцины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВакцинации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

TEMP/Documents/COV_ПрохождениеВакцинацииГрупповой/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.COV_ПрохождениеВакцинацииОтCOVID.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.COV_ПрохождениеВакцинацииОтCOVID.Добавить();
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.ВидВакцины = ВидВакцинации;
		Движение.ТипВакцины = ТекСтрокаСотрудники.ТипВакцины;
		Движение.ДатаВакцинации = ТекСтрокаСотрудники.ДатаВакцинации;
		Движение.Компонент = ТекСтрокаСотрудники.КомпонентВакцины;
		Движение.НомерПрививки = ТекСтрокаСотрудники.НомерПрививки;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	мсСтрокТЧ = Новый Массив;
	Для Каждого строкаТЧ Из Сотрудники Цикл 
		мсСтрокТЧ.Добавить(строкаТЧ);
	КонецЦикла;
	ПараметрыВакцинации = Новый Структура("Сотрудники", мсСтрокТЧ);
	COV_ОбщегоНазначения.РассчитатьНомераПрививок(ПараметрыВакцинации);
	
	Для Каждого строкаТЧ Из ПараметрыВакцинации.Сотрудники Цикл 
		изм = Сотрудники.Получить(Сотрудники.Индекс(строкаТЧ));
		ЗаполнитьЗначенияСвойств(изм, строкаТЧ, "НомерПрививки");
	КонецЦикла;
	
КонецПроцедуры
